# AreaCreationData Constructor (Object) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaCreationData Constructor (Object)
AreaCreationData Class See Also
---
Initializes a new instance of the AreaCreationData class
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public AreaCreationData(
	Object proxy
)
```

Visual Basic
---
```text
Public Sub New ( _
	proxy As Object _
)
```

Visual C++
---
```text
public:
AreaCreationData(
	Object^ proxy
)
```

# ### Parameters
proxy
    Type: System..::..Object
# See Also
AreaCreationData Class
AreaCreationData Overload
Autodesk.Revit.Creation Namespace